      ******************************************************************
      *  EIB simulation fields for local (non-CICS) execution          *
      ******************************************************************
       01  EIBTRNID               PIC X(4)    VALUE 'TEST'.
       01  EIBTRMID               PIC X(4)    VALUE 'T001'.
       01  EIBTASKN               PIC 9(7)    VALUE 0000001.
       01  EIBCALEN               PIC S9(4) VALUE +32500.
