       IDENTIFICATION DIVISION.
       PROGRAM-ID. LGUCVS01-STUB.
       DATA DIVISION.
       LINKAGE SECTION.
       01  STUB-COMMAREA          PIC X(32500).
       PROCEDURE DIVISION USING STUB-COMMAREA.
           GOBACK.
